In [1]:
from deepchecks.suites import full_suite
import pandas as pd

In [23]:
source = 'https://raw.githubusercontent.com/prodramp/publiccode/master/datasets/titanic.csv'
#source = 'https://raw.githubusercontent.com/prodramp/publiccode/master/datasets/heart.csv'

In [24]:
df = pd.read_csv(source)

In [25]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [27]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [28]:
from sklearn.model_selection import train_test_split

In [43]:
df_train, df_test = train_test_split(df, test_size=.005)

In [44]:
print(df_train.shape)
print(df_test.shape)

(886, 12)
(5, 12)

In [45]:
label_col = 'Survived'

In [46]:
from deepchecks import Dataset

In [47]:
ds_train = Dataset(df_train, label = label_col)

Automatically inferred these columns as categorical features: Pclass, Sex, SibSp, Parch, Embarked.

In [52]:
ds_test = Dataset(df_test, label = label_col, cat_features= ['Pclass', 'Sex', 'Embarked', 'Parch', 'SibSp'])

In [53]:
ds_train

In [54]:
suite = full_suite()

In [55]:
suite_result = suite.run(train_dataset=ds_train, test_dataset=ds_test)

Full Suite:   0%|          | 0/36 [00:00<?, ? Check/s]

In [56]:
suite_result

VBox(children=(HTML(value='\n        <h1 id="summary_HFLR0">Full Suite</h1>\n        <p>\n            The suit…

In [57]:
suite_result.save_as_html('titanic_full_test_bad.html')